In [59]:
import pandas as pd

In [60]:
import numpy as np

In [61]:
data=np.random.randn(4,3) #rastgele değerlerden olluşan 4*3 lük numpy matrisi

In [62]:
data

array([[-0.06369257, -0.05471113, -2.04236742],
       [-0.27908431,  0.63198336, -0.26685617],
       [-0.31076331,  1.30943628, -0.25944102],
       [-0.27366551, -0.73647911, -0.48947242]])

In [63]:
dataFrame=pd.DataFrame(data)

In [64]:
dataFrame

          0         1         2
0 -0.063693 -0.054711 -2.042367
1 -0.279084  0.631983 -0.266856
2 -0.310763  1.309436 -0.259441
3 -0.273666 -0.736479 -0.489472

In [65]:
dataFrame[0]  # ilk stunu aldık

0   -0.063693
1   -0.279084
2   -0.310763
3   -0.273666
Name: 0, dtype: float64

In [66]:
type(dataFrame[0] )

pandas.core.series.Series

In [67]:
yeniDataframe=pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"]) #data stun satırları isimlendirdik

In [68]:
yeniDataframe

            Maas       Yas  Calisma Saati
Atil   -0.063693 -0.054711      -2.042367
Zeynep -0.279084  0.631983      -0.266856
Atlas  -0.310763  1.309436      -0.259441
Mehmet -0.273666 -0.736479      -0.489472

### KOLON SEÇME

In [69]:
yeniDataframe["Calisma Saati"] #istenen kolonu getirme

Atil     -2.042367
Zeynep   -0.266856
Atlas    -0.259441
Mehmet   -0.489472
Name: Calisma Saati, dtype: float64

In [70]:
yeniDataframe[["Maas","Yas","Calisma Saati"]]

            Maas       Yas  Calisma Saati
Atil   -0.063693 -0.054711      -2.042367
Zeynep -0.279084  0.631983      -0.266856
Atlas  -0.310763  1.309436      -0.259441
Mehmet -0.273666 -0.736479      -0.489472

### SATIR SEÇME

In [71]:
yeniDataframe.loc["Atil"]

Maas            -0.063693
Yas             -0.054711
Calisma Saati   -2.042367
Name: Atil, dtype: float64

In [72]:
yeniDataframe.iloc[2] # index bzalı satır getirme

Maas            -0.310763
Yas              1.309436
Calisma Saati   -0.259441
Name: Atlas, dtype: float64

#### df indexler

In [73]:
yeniDataframe

            Maas       Yas  Calisma Saati
Atil   -0.063693 -0.054711      -2.042367
Zeynep -0.279084  0.631983      -0.266856
Atlas  -0.310763  1.309436      -0.259441
Mehmet -0.273666 -0.736479      -0.489472

#### KOLON EKLEME

In [74]:
yeniDataframe["Emeklilik Yasi"]=[60,61,63,68]     #eklenecek stun

In [75]:
yeniDataframe["Emeklilik gunu"]= yeniDataframe["Emeklilik Yasi"]+yeniDataframe["Emeklilik Yasi"]    # yeni eklenecek stun da bu toplam olsun
yeniDataframe

            Maas       Yas  Calisma Saati  Emeklilik Yasi  Emeklilik gunu
Atil   -0.063693 -0.054711      -2.042367              60             120
Zeynep -0.279084  0.631983      -0.266856              61             122
Atlas  -0.310763  1.309436      -0.259441              63             126
Mehmet -0.273666 -0.736479      -0.489472              68             136

#### KOLON SİLME

In [76]:
yeniDataframe.drop("Calisma Saati",axis=1)  #axis eksen gibi düşünülebilir   - 1 stun --- 0 satır

#axis otomatik olarak 0 gelir

            Maas       Yas  Emeklilik Yasi  Emeklilik gunu
Atil   -0.063693 -0.054711              60             120
Zeynep -0.279084  0.631983              61             122
Atlas  -0.310763  1.309436              63             126
Mehmet -0.273666 -0.736479              68             136

#### satır silme

In [80]:
yeniDataframe.drop("Atlas")  #axis=0 yazmad da aynı işe yarar yazmasask da olur   axis yazmadık

            Maas       Yas  Calisma Saati  Emeklilik Yasi  Emeklilik gunu
Atil   -0.063693 -0.054711      -2.042367              60             120
Zeynep -0.279084  0.631983      -0.266856              61             122
Mehmet -0.273666 -0.736479      -0.489472              68             136

In [81]:
yeniDataframe.drop("Atlas", axis=0 )  #axis=0 yazmadan da aynı işe yarar yazmasask da olur  axis yazdık

            Maas       Yas  Calisma Saati  Emeklilik Yasi  Emeklilik gunu
Atil   -0.063693 -0.054711      -2.042367              60             120
Zeynep -0.279084  0.631983      -0.266856              61             122
Mehmet -0.273666 -0.736479      -0.489472              68             136

#### tüm bu satırda ekleme çıkarma işlemleri kopya üzerinde yaplır ana yapıyı değiştirmez

In [82]:
yeniDataframe

            Maas       Yas  Calisma Saati  Emeklilik Yasi  Emeklilik gunu
Atil   -0.063693 -0.054711      -2.042367              60             120
Zeynep -0.279084  0.631983      -0.266856              61             122
Atlas  -0.310763  1.309436      -0.259441              63             126
Mehmet -0.273666 -0.736479      -0.489472              68             136

#### kalıcı değişiklik yapma

In [83]:
yeniDataframe.drop("Emeklilik Yasi",axis=1,inplace=True)
#inplace değeri default olarak false dir TRUE olunca kalıcı değişiklik yapar

In [84]:
yeniDataframe

            Maas       Yas  Calisma Saati  Emeklilik gunu
Atil   -0.063693 -0.054711      -2.042367             120
Zeynep -0.279084  0.631983      -0.266856             122
Atlas  -0.310763  1.309436      -0.259441             126
Mehmet -0.273666 -0.736479      -0.489472             136

In [86]:
yeniDataframe.loc["Atil"]["Yas"] ## istenene değeri alma --- satır stun karşılığını allıyoruz .

np.float64(-0.05471113162025513)

In [87]:
yeniDataframe.loc["Atil","Yas"]

np.float64(-0.05471113162025513)

In [88]:
yeniDataframe

            Maas       Yas  Calisma Saati  Emeklilik gunu
Atil   -0.063693 -0.054711      -2.042367             120
Zeynep -0.279084  0.631983      -0.266856             122
Atlas  -0.310763  1.309436      -0.259441             126
Mehmet -0.273666 -0.736479      -0.489472             136

In [89]:
 #istenen değerden küçük büyükleri bulma

In [90]:
yeniDataframe<0

        Maas    Yas  Calisma Saati  Emeklilik gunu
Atil    True   True           True           False
Zeynep  True  False           True           False
Atlas   True  False           True           False
Mehmet  True   True           True           False

In [100]:
boleanFrame=yeniDataframe>0 #0 dan büyükleri true işaretler
boleanFrame

         Maas    Yas  Calisma Saati  Emeklilik gunu
Atil    False  False          False            True
Zeynep  False   True          False            True
Atlas   False   True          False            True
Mehmet  False  False          False            True

In [101]:
yeniDataframe[boleanFrame]  #0 dan büyük olan değerleri yazar

        Maas       Yas  Calisma Saati  Emeklilik gunu
Atil     NaN       NaN            NaN             120
Zeynep   NaN  0.631983            NaN             122
Atlas    NaN  1.309436            NaN             126
Mehmet   NaN       NaN            NaN             136

In [107]:
yeniDataframe[yeniDataframe["Yas"]>0]  ##yaş 0 dan büyük olan satırları yazdırdı .

            Maas       Yas  Calisma Saati  Emeklilik gunu
Zeynep -0.279084  0.631983      -0.266856             122
Atlas  -0.310763  1.309436      -0.259441             126

### İNDEX DEĞİŞTİRME

In [112]:
yeniDataframe.reset_index()

    index      Maas       Yas  Calisma Saati  Emeklilik gunu
0    Atil -0.063693 -0.054711      -2.042367             120
1  Zeynep -0.279084  0.631983      -0.266856             122
2   Atlas -0.310763  1.309436      -0.259441             126
3  Mehmet -0.273666 -0.736479      -0.489472             136

In [110]:
yeniDataframe

            Maas       Yas  Calisma Saati  Emeklilik gunu
Atil   -0.063693 -0.054711      -2.042367             120
Zeynep -0.279084  0.631983      -0.266856             122
Atlas  -0.310763  1.309436      -0.259441             126
Mehmet -0.273666 -0.736479      -0.489472             136

In [113]:
yeniIndexListesi=["Ati","Zey","Atl","Meh"]  #diyelim ki indexleri bu şekilde güncellemek isteyelim

In [114]:
yeniDataframe["Yeni Index"]=yeniIndexListesi #yeni index kolonun ekledik dataframe ye normal kolon ekleme yöntemi ile

In [116]:
yeniDataframe

            Maas       Yas  Calisma Saati  Emeklilik gunu Yeni Index
Atil   -0.063693 -0.054711      -2.042367             120        Ati
Zeynep -0.279084  0.631983      -0.266856             122        Zey
Atlas  -0.310763  1.309436      -0.259441             126        Atl
Mehmet -0.273666 -0.736479      -0.489472             136        Meh

In [117]:
yeniDataframe.set_index("Yeni Index")   #data framedeki bir stunu yeni indexler olarak ayarladık

                Maas       Yas  Calisma Saati  Emeklilik gunu
Yeni Index
Ati        -0.063693 -0.054711      -2.042367             120
Zey        -0.279084  0.631983      -0.266856             122
Atl        -0.310763  1.309436      -0.259441             126
Meh        -0.273666 -0.736479      -0.489472             136

In [ ]:
yeniDataframe #yeni data frameyi değiştirmez bu işlemler inplace =true il değişiklikler  işlenir

In [118]:
yeniDataframe.set_index("Yeni Index",inplace=True)

In [119]:
yeniDataframe #değişiklikler kaydedildi

                Maas       Yas  Calisma Saati  Emeklilik gunu
Yeni Index
Ati        -0.063693 -0.054711      -2.042367             120
Zey        -0.279084  0.631983      -0.266856             122
Atl        -0.310763  1.309436      -0.259441             126
Meh        -0.273666 -0.736479      -0.489472             136

In [121]:
yeniDataframe.loc["Ati"]

Maas               -0.063693
Yas                -0.054711
Calisma Saati      -2.042367
Emeklilik gunu    120.000000
Name: Ati, dtype: float64

#### MULTİ İNDEX

In [122]:

ilkIndeksler = [ "Simpson" , "Simpson", "Simpson" , "South Park", "South Park", "South Park" ]

icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny", "Kyle" ]

In [123]:
birlesmisIndex=list(zip(ilkIndeksler,icIndeksler))

In [124]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [125]:

birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex) # çoklu index olarak ayarladık

In [126]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [127]:
myCizgiFilmListem=[[60,"A"],[50,"B"],[40,"C"],[30,"D"],[20,"E"],[10,"F"]]

In [129]:
myCizgiFilmNumpyListem=np.array(myCizgiFilmListem)

In [136]:
myCizgiFilmDataFrame=pd.DataFrame(myCizgiFilmNumpyListem,index=birlesmisIndex , columns=["yas","meslek"] )

In [137]:
myCizgiFilmDataFrame

                   yas meslek
Simpson    Homer    60      A
           Bart     50      B
           Marge    40      C
South Park Cartman  30      D
           Kenny    20      E
           Kyle     10      F

In [143]:
myCizgiFilmDataFrame.loc["Simpson"] #simpson  getir dedik ve o ailden olan  homer bart marge yi getirdi

      yas meslek
Homer  60      A
Bart   50      B
Marge  40      C

In [144]:
myCizgiFilmDataFrame.loc["South Park"].loc["Kenny"] # alt alandan veri aldık

yas       20
meslek     E
Name: Kenny, dtype: object

In [149]:
myCizgiFilmDataFrame.index.names=["Film Adi","isim"] # kolon isimleri değiştirme

In [150]:
myCizgiFilmDataFrame

                   yas meslek
Film Adi   isim
Simpson    Homer    60      A
           Bart     50      B
           Marge    40      C
South Park Cartman  30      D
           Kenny    20      E
           Kyle     10      F